#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.github_organization.github_organization_ruleset.default_ruleset will be created
  + resource "github_organization_ruleset" "default_ruleset" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Main Branch Protection"
      + node_id     = (known after apply)
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "main",
                  + "master",
                ]
            }
          + repository_name {
              + exclude   = []
              + include   = [
                  + "*",
                ]
              + protected = false
            }
        }

      + rules {
          + pull_request {
              + dismiss_stale_reviews_on_push     = true
              + require_code_owner_review         = true
              + require_last_push_approval        = false
              + required_approving_review_count   = 2
              + required_review_thread_resolution = false
            }
        }
    }

  # module.github_organization.github_organization_settings.org_settings will be created
  + resource "github_organization_settings" "org_settings" {
      + advanced_security_enabled_for_new_repositories               = false
      + billing_email                                                = "XXXXXXXXXXXXXXXXXXXXXX"
      + default_repository_permission                                = "read"
      + dependabot_alerts_enabled_for_new_repositories               = false
      + dependabot_security_updates_enabled_for_new_repositories     = false
      + dependency_graph_enabled_for_new_repositories                = false
      + has_organization_projects                                    = true
      + has_repository_projects                                      = true
      + id                                                           = (known after apply)
      + members_can_create_pages                                     = false
      + members_can_create_private_pages                             = true
      + members_can_create_private_repositories                      = true
      + members_can_create_public_pages                              = true
      + members_can_create_public_repositories                       = true
      + members_can_create_repositories                              = false
      + members_can_fork_private_repositories                        = false
      + name                                                         = "abyssinia-io"
      + secret_scanning_enabled_for_new_repositories                 = false
      + secret_scanning_push_protection_enabled_for_new_repositories = false
      + web_commit_signoff_required                                  = false
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + organization_id   = "abyssinia-io"
  + organization_name = "abyssinia-io"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @nega-xavier, Action: `pull_request`, Working Directory: `config-as-code`, Workflow: `Terraform CI/CD`*